backend: !!python/unicode 'tensorflow'
class_name: Model
config:
  input_layers:
  - [input_words, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 56]
      dtype: int32
      name: input_words
      sparse: false
    inbound_nodes: []
    name: input_words
  - class_name: Embedding
    config:
      activity_regularizer: null
      batch_input_shape: !!python/tuple [null, null]
      dtype: float32
      embeddings_constraint: null
      embeddings_initializer:
        class_name: RandomUniform
        config: {maxval: 0.05, minval: -0.05, seed: null}
      embeddings_regularizer: null
      input_dim: 15349
      input_length: null
      mask_zero: false
      name: word_embedding
      output_dim: 300
      trainable: false
    inbound_nodes:
    - - - input_words
        - 0
        - 0
        - {}
    name: word_embedding
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      go_backwards: false
      implementation: 1
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: bidirectional
      recurrent_activation: hard_sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config: {gain: 1.0, seed: null}
      recurrent_regularizer: null
      return_sequences: false
      return_state: false
      stateful: false
      trainable: true
      unit_forget_bias: true
      units: 50
      unroll: false
      use_bias: true
    inbound_nodes:
    - - - word_embedding
        - 0
        - 0
        - {}
    name: bidirectional
  name: model_2
  output_layers:
  - [bidirectional, 0, 0]
keras_version: 2.1.4
